Sardire/Game2048---with-STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32f429i_discovery_lcd.h"
#include "game2048.h"
#include "display.h"
#include "joystick.h"
#include <stdlib.h>
#include <stdio.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;

CRC_HandleTypeDef hcrc;

DMA2D_HandleTypeDef hdma2d;

I2C_HandleTypeDef hi2c3;

LTDC_HandleTypeDef hltdc;

SPI_HandleTypeDef hspi5;

TIM_HandleTypeDef htim1;

UART_HandleTypeDef huart1;

SDRAM_HandleTypeDef hsdram1;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CRC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C3_Init(void);
static void MX_SPI5_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_ADC1_Init(void);
static void MX_LTDC_Init(void);
static void MX_ADC2_Init(void);
void MX_USB_HOST_Process(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_CRC_Init();
  MX_DMA2D_Init();
  MX_FMC_Init();
  MX_I2C3_Init();
  MX_SPI5_Init();
  MX_TIM1_Init();
  MX_USART1_UART_Init();
  MX_USB_HOST_Init();
  MX_ADC1_Init();
  MX_LTDC_Init();
  MX_ADC2_Init();
  /* USER CODE BEGIN 2 */

  /* TEST BƯỚC 1: Logic game */
  Display_Init();
  BSP_LCD_DisplayOn();

  BSP_LCD_SelectLayer(0);
      BSP_LCD_SetLayerVisible(0, ENABLE);
      /* --- Seed ngẫu nhiên --- */
      srand(HAL_GetTick());
      /* --- Khởi tạo game và màn hình --- */
      Game2048 game;
      Game_Init(&game);
      Display_Init();
      Display_DrawBoard(&game);
      bool game_ended = false;
      /* --- Vòng lặp chính --- */
      for(;;)
      {
          /* Nút B1 (PA0 = HIGH khi nhấn) → Reset game */
          if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0) == GPIO_PIN_SET) {
              HAL_Delay(200);  /* Chống dội nút */
              game_ended = false;
              Game_Init(&game);
              Display_Init();
              Display_DrawBoard(&game);
              HAL_GPIO_WritePin(GPIOG, GPIO_PIN_13, GPIO_PIN_RESET);
              HAL_GPIO_WritePin(GPIOG, GPIO_PIN_14, GPIO_PIN_RESET);
          }
          if (!game_ended) {
              JoyDirection dir = Joystick_Read();
              bool moved = false;
              switch (dir) {
                  case JOY_UP:    moved = Game_MoveUp   (&game); break;
                  case JOY_DOWN:  moved = Game_MoveDown  (&game); break;
                  case JOY_LEFT:  moved = Game_MoveLeft  (&game); break;
                  case JOY_RIGHT: moved = Game_MoveRight (&game); break;
                  default: break;
              }
              if (moved) {
                  Game_SpawnTile(&game);
                  Display_DrawBoard(&game);
                  if (Game_CheckWin(&game)) {
                      Display_ShowMessage("YOU WIN!");
                      HAL_GPIO_WritePin(GPIOG, GPIO_PIN_13, GPIO_PIN_SET); /* LED xanh */
                      game_ended = true;
                  } else if (Game_CheckLose(&game)) {
                      Display_ShowMessage("GAME OVER!");
                      HAL_GPIO_WritePin(GPIOG, GPIO_PIN_14, GPIO_PIN_SET); /* LED đỏ */
                      game_ended = true;
                  }
              }
          }
          HAL_Delay(50);  /* ~20 FPS poll rate */
      }
  /* TEST BƯỚC 3: Joystick */
  Display_Init();
  BSP_LCD_SetFont(&Font16);
  BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
  BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
  Joystick_Calibrate();

  for(;;) {
      uint16_t ax, ay;
      Joystick_GetRaw(&ax, &ay);

      char buf[40];
      BSP_LCD_SetTextColor(LCD_COLOR_WHITE);

      sprintf(buf, "X = %4d   Y = %4d", ax, ay);
      BSP_LCD_DisplayStringAt(10, 110, (uint8_t*)buf, LEFT_MODE);

      JoyDirection d = Joystick_Read();

      // Đảm bảo tất cả các chuỗi hướng có độ dài bằng nhau (5 ký tự) để tự ghi đè lên nhau
      const char *dname[] = {"NONE ", "UP   ", "DOWN ", "LEFT ", "RIGHT"};

      sprintf(buf, "DIR: %s", dname[d]);
      BSP_LCD_DisplayStringAt(10, 135, (uint8_t*)buf, LEFT_MODE);

      HAL_Delay(50);
  }

  /* USER CODE END 2 */

